//++РС Консалт Вечканов Владимир 08.01.2021 № Задачи 126
Процедура РСК_ПолучитьЧасыФакт() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Трудозатраты.Длительность / 3600) КАК Длительность
		|ИЗ
		|	РегистрСведений.Трудозатраты КАК Трудозатраты
		|ГДЕ
		|	Трудозатраты.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЧасыФакт = Выборка.Длительность;
	КонецЦикла;
КонецПроцедуры
//--РС Консалт Вечканов Владимир 08.01.2021 № Задачи 126

&После("ПередЗаписью")
Процедура РСК_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//++РС Консалт Вечканов Владимир 08.01.2021 № Задачи 126
	РСК_ПолучитьЧасыФакт();
	//--РС Консалт Вечканов Владимир 08.01.2021 № Задачи 126
	Если Не ЭтоНовый() И ЗначениеЗаполнено(ТекущийЭтап)  
		И ТекущийЭтап.СостояниеЭтапа = ПредопределенноеЗначение("Перечисление.СостоянияЭтаповПроцесса.Закрыт")
		И Ссылка.ТекущийЭтап.СостояниеЭтапа <> ПредопределенноеЗначение("Перечисление.СостоянияЭтаповПроцесса.Закрыт") Тогда
		ДополнительныеСвойства.Вставить("ЭтоЗакрытиеЗадания", Истина);
	КонецЕсли;
	
	//++Пашков - задача 111
	Свойство = УправлениеСвойствами.ПолучитьСвойствоПоИмени("ДляРазработчика");
	Значение = "Процесс_Перезвонить";
	ПроцессПерезвонить = УправлениеСвойствами.ПолучитьОбъектПоЗачениюСвойства(Свойство, Значение);
	
	Если Процесс = ПроцессПерезвонить
		И Основания.Количество() = 0 Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для процесса ""Перезвонить"" обязательно заполнение основания!'"));
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	//--Пашков
	
	//Пашков - Задача 110 --- Тип процесса сходит с ума. Почему-то, периодически, не перезаполняется из процесса.
	Если ЗначениеЗаполнено(Процесс) Тогда
		ТипПроцесса = Процесс.ТипПроцесса;
	КонецЕсли;
	//++ РС Консалт: Полякова Елизавета 09.03.2021 Задача 3431
	//e1cib/data/Документ.Задание?ref=bd11fab245c3b5344d51705fe44870c0
	Если Проведен И Выполнено = Истина И Завершено = Ложь И ТекущийЭтап.СостояниеЭтапа = ПредопределенноеЗначение("Перечисление.СостоянияЭтаповПроцесса.Закрыт") Тогда
		Завершено = Истина;
		ДатаЗавершения = ТекущаяДатаСеанса();
	КонецЕсли;
	//-- КонецЗадачи 3431
	//++ Горохов 23.04.21 Задача №4707
	Если Наблюдатели.Найти(Проект.РуководительПроекта) = Неопределено тогда
		Если ЗначениеЗаполнено(Проект.РуководительПроекта) тогда
			НовыйНаблюдатель = Наблюдатели.Добавить();
			НовыйНаблюдатель.Адресат = Проект.РуководительПроекта;	
		КонецЕсли;	
	КонецЕсли;
	//--КонецЗадачи 4707
	//++Горохов И. 27.04.21 Задача № 4704
	Если НЕ ЗначениеЗаполнено(Подразделение) тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Автор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() тогда
			ВыборкаДетальныеЗаписи.Следующий();
			Подразделение = Автор.Подразделение;
		КонецЕсли;	
	КонецЕсли;
	//--КонецЗадачи 4704
КонецПроцедуры

&После("ПриЗаписи")
Процедура РСК_ПриЗаписи(Отказ)	
	Перем ЭтоЗакрытиеЗадания;	
	//Пашков
	Если ДополнительныеСвойства.Свойство("ЭтоЗакрытиеЗадания", ЭтоЗакрытиеЗадания) 
		И ЭтоЗакрытиеЗадания = Истина Тогда	
		ЗаписатьКомментарийВЗаданиеОснование();	
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьКомментарийВЗаданиеОснование()
	
	Для каждого СтрокаОснование Из Основания Цикл
		
		Если ТипЗнч(СтрокаОснование.Основание) <> Тип("ДокументСсылка.Задание")
			ИЛИ СтрокаОснование.Основание.ТипПроцесса <> Справочники.ТипыПроцессов.Инцидент Тогда
			Продолжить;
		КонецЕсли;
		
		Сообщение = "Задание " + Строка(ЭтотОбъект) + " закрыто.";
		ПараметрыКоментария = Новый Структура;
		ПараметрыКоментария.Вставить("ТекстСообщения", Сообщение); 
		ПараметрыКоментария.Вставить("Автор", ПараметрыСеанса.ТекущийПользователь);
		ПараметрыКоментария.Вставить("ИдентификаторСообщения", Строка(Новый УникальныйИдентификатор));
		
		Комментарии.Добавить(СтрокаОснование.Основание, ПараметрыКоментария);
		
	КонецЦикла;
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура РСК_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//++РС Консалт: Полякова Е.Л. 31.01.2021 Задача №549
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задание") Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		Инициатор = ДанныеЗаполнения.Инициатор;
	КонецЕсли;
	//--РС Консалт: Полякова Е.Л. 31.01.2021 Задача №549
	
	//++РС Консалт: Минаков А.С. 11.01.2021 Задача 121
	Если Не ЗначениеЗаполнено(Процесс) Тогда
		Процесс = Справочники.РС_Переменные.ПолучитьПеременную("ПроцессПоУмолчанию");
	КонецЕсли;
	//++РС Консалт: Минаков А.С. 11.01.2021 Задача 121
	
	//++ РС Консалт: Тарасов Михаил 15.06.2021 Задача 4345
	//e1cib/data/Документ.Задание?ref=b5a68afa715fa5574ba91f32425b5aea
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТелефонныйЗвонок") 
		И ЗначениеЗаполнено(Инициатор) 
		И НЕ ЗначениеЗаполнено(Клиент) Тогда
		
		Клиент = Инициатор.Владелец;
		Если ЗначениеЗаполнено(Клиент) И Не ЗначениеЗаполнено(Проект) Тогда
			ПроектКлиента = ПолучитьПроектКлиентаНаСервереБезКонтекста(Клиент);
			Если ПроектКлиента <> Неопределено Тогда
				Проект = ПроектКлиента;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	//-- КонецЗадачи 4345
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПроектКлиентаНаСервереБезКонтекста(Клиент)
	//++РС Консалт: Минаков А.С. 06.01.2020 Задача 121
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Проект
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	НЕ Проекты.ПометкаУдаления
		|	И Проекты.Клиент = &Клиент");
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Проекты = Запрос.Выполнить().Выгрузить();
	
	Если Проекты.Количество() <> 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Проекты[0].Проект;
	//++РС Консалт: Минаков А.С. 06.01.2020 Задача 121
КонецФункции
