
&НаКлиенте
Процедура ПолучитьТаблицу(Команда)
	ОткрытьФорму("ВнешнийОтчет.ОтчетПоТаблицеBitCop.Форма.ФормаПарсингаТаблицы",,ЭтотОбъект,,,,
	Новый ОписаниеОповещения("ПолучитьТаблицуЗавершение",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТаблицуЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат <> Неопределено Тогда
		Отчет.ТаблицаУРВ.Очистить();
		
		ЗаполнитьТаблицуУРВНаСервере(Результат);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуУРВНаСервере(АдресХранилища)
	пТаблицаУРВ = ПолучитьИзВременногоХранилища(АдресХранилища);
	Для Каждого Стр Из пТаблицаУРВ Цикл
		ЗаполнитьЗначенияСвойств(Отчет.ТаблицаУРВ.Добавить(),Стр);
	КонецЦикла;	
		
КонецПроцедуры
