//++ РС Консалт: Тарасов Михаил 03.06.2021 Задача 4345
//e1cib/data/Документ.Задание?ref=b5a68afa715fa5574ba91f32425b5aea
Функция ЗаполнитьСписокТелефонов(СписокОбъектов) Экспорт
	
	СписокТелефонов = Новый СписокЗначений;
	
	Для Каждого ОбъектИнформации ИЗ СписокОбъектов Цикл
		
		Если ТипЗнч(ОбъектИнформации.Значение) = Тип("Строка") Тогда
			СписокТелефонов.Добавить(ОбъектИнформации.Значение);
		Иначе		
			Попытка
				КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОбъектИнформации.Значение,,, Ложь);	
				Для Каждого СтрокаКИ ИЗ КонтактнаяИнформация Цикл
					Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
						СписокТелефонов.Добавить(СтрокаКИ.Представление);
					КонецЕсли;
				КонецЦикла;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокТелефонов;
	
КонецФункции

Процедура ПозвонитьПоНомеруЧерезОблачнуюАТС(ПользовательАТС, НомерТелефона) Экспорт	
	
	Соединение = Новый HTTPСоединение("vpbx381206422.domru.biz",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос("/sys/crm_api.wcgp?cmd=makeCall&phone=" + НомерТелефона + "&user=" + ПользовательАТС + "&token=" + Константы.РС_ТокенОблачнойАТС.Получить());
	Попытка
		Результат = Соединение.Получить(Запрос);
	Исключение
		Сообщить("Ошибка подключения к серверу ДОМ.ру для формирования звонка");
		Возврат;
	КонецПопытки;
	
	Если Результат.КодСостояния <> 200 Тогда
		Сообщить("Получен некорректный код ответа от ДОМ.ру: " + Результат.КодСостояния);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
//-- КонецЗадачи 4345


