//++ РС Консалт: Полякова Елизавета 11.02.2021 Задача 2094
//e1cib/data/Документ.Задание?ref=b1d3d6620c7fa00440669c2d0b7137a3
&После("ПриЗаписи")
Процедура РСК_ПриЗаписи(Отказ)
	Если ПустаяСтрока(ЭтотОбъект.ИНН) Тогда
		ВызватьИсключение("Нельзя записать контрагента без ИНН");
	КонецЕсли;
	Если Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН) <> Справочники.Контрагенты.ПустаяСсылка() И Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН) <> ЭтотОбъект.Ссылка Тогда
		ВызватьИсключение("Контрагент с указанным ИНН уже существует: """ + Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН) + """");
	КонецЕсли;
	Если Справочники.Контрагенты.НайтиПоНаименованию(Наименование) <> Справочники.Контрагенты.ПустаяСсылка() И Справочники.Контрагенты.НайтиПоНаименованию(Наименование) <> ЭтотОбъект.Ссылка Тогда
		ВызватьИсключение("Контрагент с указанным наименованием уже существует: """ + Справочники.Контрагенты.НайтиПоНаименованию(Наименование) + """");
	КонецЕсли;
КонецПроцедуры
//-- КонецЗадачи 2094