Функция СведенияОВнешнейОбработке() Экспорт
	Имя = ЭтотОбъект.Метаданные().Имя;
	Представление = ЭтотОбъект.Метаданные().Синоним;

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	ПараметрыРегистрации.Назначение.Добавить("Справочник.Проекты");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.Наименование = Представление;
	ПараметрыРегистрации.Информация = "РС Консалт";
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = Представление;
	Команда.Идентификатор = Имя;
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации; 
КонецФункции