
&Вместо("ДвиженияРС_Работы")
Процедура РСК_ДвиженияРС_Работы()
	Движения.РС_Работы.Очистить();
	Движения.РС_Работы.Записывать 	= Истина;
	НоваяЗапись 					= Движения.РС_Работы.Добавить();
	НоваяЗапись.Период 				= ДатаНачала;
	НоваяЗапись.ВидДвижения 		= ВидДвиженияНакопления.Приход;
	//++ Горохов И. задача №5283 26.04.21
	Если ВидРаботы = Справочники.ВидыРабот.РаботыВРамкахИТС тогда
		НоваяЗапись.ВремяКлиента		= 0;
	Иначе
		НоваяЗапись.ВремяКлиента		= ВремяКлиента;
	КонецЕсли;
	//-- 
	НоваяЗапись.Занятость			= Ссылка;
	НоваяЗапись.ФактическоеВремя	= ФактическаяТрудоемкость;
КонецПроцедуры
