//++ Горохов И 31.05.21 Задача № 7054
&НаКлиенте
Процедура РСК_табПроектыПередНачаломДобавленияВместо(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Объект.Ссылка);
	ПараметрыФормы.Вставить("Родитель", Объект.Ссылка);
	ОткрытьФорму("Справочник.Проекты.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура РСК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	табПроекты.Параметры.УстановитьЗначениеПараметра("Клиент", Объект.Ссылка);
КонецПроцедуры
//++ Конец задачи № 7054