Функция СведенияОВнешнейОбработке() Экспорт
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.РС_ОтчетКлиенту");
	Имя = ЭтотОбъект.Метаданные().Имя;
	Представление = ЭтотОбъект.Метаданные().Синоним;
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Версия = "0.1";
	ПараметрыРегистрации.Наименование = Представление;
	ПараметрыРегистрации.Назначение = МассивНазначений;
	ПараметрыРегистрации.Информация = "Разработчик: Я.Карпов 19.02.2021";
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = '"+Представление+"'");
	Команда.Идентификатор = Имя;
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	Команда.ПоказыватьОповещение = Ложь;
	Возврат ПараметрыРегистрации; 
КонецФункции

Процедура Печать(ИдентификаторКоманды, МассивОбъектов) Экспорт
	Праметры1 = Новый Структура;
	Праметры1.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	//ЭтаФорма.ПечатьНаКлиенте(МассивОбъектов[0]);
	
КонецПроцедуры
