//++ РС Консалт: Полякова Елизавета 09.03.2021 Задача 3433
//e1cib/data/Документ.Задание?ref=b27dd270d86b35ec437f9bccb680fea2
&НаКлиенте
Процедура РСК_ОтборКлиентПриИзмененииВместо(Элемент)
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Клиент", ОтборКлиент, ЗначениеЗаполнено(ОтборКлиент));
КонецПроцедуры

&НаКлиенте
Процедура РСК_ОтборПроектПриИзмененииВместо(Элемент)
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Проект", ОтборПроект, ЗначениеЗаполнено(ОтборПроект));
КонецПроцедуры

&НаКлиенте
Процедура РСК_ОтборКлиентНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТипСтр = "СправочникСсылка.Контрагенты";
	Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	Значение = ОтборКлиент;
	ОтборКлиент = Элемент.ОграничениеТипа.ПривестиЗначение(Значение);
	Элемент.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РСК_ОтборИнициаторНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТипСтр = "СправочникСсылка.КонтактныеЛица";
	Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	Значение = ОтборИнициатор;
	ОтборИнициатор = Элемент.ОграничениеТипа.ПривестиЗначение(Значение);
	Элемент.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РСК_ПриОткрытииПосле(Отказ) 
	Список.Отбор.Элементы.Очистить();
	Если ЗначениеЗаполнено(Параметры.Клиент) Тогда
		ОтборКлиент = ВладелецФормы.Родитель.Клиент;
		РСК_ОтборКлиентПриИзмененииВместо(Неопределено);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Проект) Тогда
		ОтборПроект = ВладелецФормы.Родитель.Проект;
		РСК_ОтборПроектПриИзмененииВместо(Неопределено);
	КонецЕсли;
	ОтборЗаданиеЗакрыто = Ложь;
	РСК_ОтборЗаданиеЗакрытоПриИзмененииВместо(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура РСК_ОтборЗаданиеЗакрытоПриИзмененииВместо(Элемент)
	Если ОтборЗаданиеЗакрыто Тогда
		РаботаСОтборамиКлиентСервер.УдалитьЭлементОтбораСписка(Список, "ТекущийЭтап.СостояниеЭтапа");
	Иначе
		ОтборЭтап = СостояниеЭтапа();
		РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ТекущийЭтап.СостояниеЭтапа", ОтборЭтап, ЗначениеЗаполнено(ОтборЭтап), ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СостояниеЭтапа()
	Возврат Перечисления.СостоянияЭтаповПроцесса.Закрыт;
КонецФункции;
//-- КонецЗадачи 3433