Функция СведенияОВнешнейОбработке() Экспорт
	Имя = ЭтотОбъект.Метаданные().Имя;
	Представление = ЭтотОбъект.Метаданные().Синоним;

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Версия = "0.1";
	ПараметрыРегистрации.Наименование = Представление;
	ПараметрыРегистрации.Информация = "Разработчик: И.Горохов 27.12.2021";
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = '"+Представление+"'");
	Команда.Идентификатор = Имя;
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	Возврат ПараметрыРегистрации; 
КонецФункции
