//Пашков
Функция ПолучитьОбъектПоЗачениюСвойства(Свойство, Значение) Экспорт
	
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		Свойство = ПолучитьСвойствоПоИмени("ДляРазработчика");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Свойство)
		ИЛИ Не ЗначениеЗаполнено(Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Значение", Значение);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Объект;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСвойствоПоИмени(Имя) Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", Имя);
	
КонецФункции

