Перем Имя;
Перем Версия;

Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.3.82");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = Версия;
	ПараметрыРегистрации.Информация = "Разработчик: ООО ""РС Консалт"", тел.: (3812) 332-331"
		+Символы.ПС+"Автор: Евгений Трофимов, 2022"
		+Символы.ПС+"Добавлено "+ТекущаяДата()+" при версии БСП: "+СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = '"+Имя+"'");
	Команда.Идентификатор = СтрЗаменить(Имя," ","_");
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	Возврат ПараметрыРегистрации;
КонецФункции

Имя = ЭтотОбъект.Метаданные().Синоним;
Версия = "1.0.0.8";