//++РС Консалт Вечканов Владимир 08.01.2021 № Задачи 126
&НаСервере
&После("ЗаписатьНаСервере")
Процедура РСК_ЗаписатьНаСервере()
	Если ТипЗнч(Запись.Объект) = Тип("ДокументСсылка.Задание") Тогда
		ЗадачаОб = Запись.Объект.ПолучитьОбъект();
		ЗадачаОб.ЧасыФакт = ЗадачаОб.ЧасыФакт + Запись.Длительность;
		ЗадачаОб.Записать();
	КонецЕсли;	
КонецПроцедуры	
//--РС Консалт Вечканов Владимир 08.01.2021 № Задачи 126

//++РС Консалт: Полякова Е.Л. 01.02.2021 Задача №175
&НаКлиенте
Процедура РСК_ПриОткрытииВместо(Отказ)
	ЭтаФорма.Закрыть();
	СсылкаНаДокумент = ОпределитьЗанятость();
	ОткрытьФорму("Документ.РС_Занятость.Форма.ФормаДокументаБыстраяЗанятость", Новый Структура("Ключ", СсылкаНаДокумент));
КонецПроцедуры

&НаСервере
Функция ОпределитьЗанятость()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_Занятость.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РС_Занятость КАК РС_Занятость
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Трудозатраты КАК Трудозатраты
		|		ПО РС_Занятость.Задание = Трудозатраты.Объект
		|			И РС_Занятость.Исполнитель = Трудозатраты.Исполнитель
		|			И РС_Занятость.ДатаНачала = Трудозатраты.ДатаНачала  
		|			И РС_Занятость.ДатаОкончания = Трудозатраты.ДатаОкончания
		|ГДЕ
		|	Трудозатраты.Объект = &Объект
		|	И Трудозатраты.Исполнитель = &Исполнитель
		|	И Трудозатраты.ДатаНачала = &ДатаНачала
		|	И Трудозатраты.ДатаОкончания = &ДатаОкончания";	
	Запрос.УстановитьПараметр("Объект", Запись.Объект);
    Запрос.УстановитьПараметр("Исполнитель", Запись.Исполнитель);
	Запрос.УстановитьПараметр("ДатаНачала", Запись.ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", Запись.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецФункции
//--РС Консалт: Полякова Е.Л. 01.02.2021 Задача №175