&НаКлиенте
Перем ВыбранныеШаблоны;
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Нас интересует только событие нажатия на чекбокс
	Если Поле = Элементы.Пометка Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			Если ТекущиеДанные.Пометка Тогда
				СнятьПометку(ТекущиеДанные.Ссылка);
			Иначе
				ПоставитьПометку(ТекущиеДанные.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	//Параметр в динамическом списке нужно обновить
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныеШаблоны", ВыбранныеШаблоны);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Шаблон)
	Индекс = ВыбранныеШаблоны.Найти(Шаблон);
	Если Индекс >= 0 Тогда
		ВыбранныеШаблоны.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьПометку(Шаблон)
	Индекс = ВыбранныеШаблоны.Найти(Шаблон);
	Если Индекс = Неопределено Тогда
		ВыбранныеШаблоны.Добавить(Шаблон);
	КонецЕсли;
КонецПроцедуры
