Перем Имя;
Перем Версия;
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    Настройки = КомпоновщикНастроек.Настройки;
    ЭД = Настройки.ПараметрыДанных.Элементы.Найти("Календарь");
    ЭД.Значение = Справочники.Календари.НайтиПоНаименованию("Российская Федерация",Истина);
    ЭД.Использование = Истина;	
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.1.342");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = Версия;
	ПараметрыРегистрации.Информация = "Разработчик: ООО ""РС Консалт"", тел.: (3812) 332-331"
							+Символы.ПС+"Автор: Евгений Трофимов, 2022"
							+Символы.ПС+"Добавлено "+ТекущаяДата()+" при версии БСП: "+СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = '"+Имя+"'");
	Команда.Идентификатор = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Имя);
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	Возврат ПараметрыРегистрации;
КонецФункции

Имя = ЭтотОбъект.Метаданные().Синоним;
Версия = "1.2.0.1";