//Отключено в связи с изменением концепции получения звонков

//&После("ПриНачалеРаботыСистемы")
//Процедура РСК_ПриНачалеРаботыСистемы()
//	//++ 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
//	ПериодОбновления = УправлениеITОтделом8УФПовтИсп.ПолучитьЗначениеНастройки("РС_ПериодОбновленияНовыхЗвонков");
//	ПроверятьЗвонки = УправлениеITОтделом8УФПовтИсп.ПолучитьЗначениеНастройки("РС_СоздаватьДокументТелефонныйЗвонокПриЗвонке");
//	Если ПроверятьЗвонки И ПериодОбновления <> Неопределено И ПериодОбновления > 0 Тогда		
//		ПодключитьОбработчикОжидания("ПроверитьНовыеЗвонки", ПериодОбновления, Ложь);
//	КонецЕсли;
//	//-- 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
//КонецПроцедуры

////++ 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
//Процедура ПроверитьНовыеЗвонки() Экспорт
//	ДанныеЗвонка = ОбщегоНазначенияВызовСервера.ПолучитьДанныеНовогоЗвонка();
//	Если ДанныеЗвонка.Количество() > 0 Тогда
//		Для Счетчик = 0 По ДанныеЗвонка.Количество() Цикл
//			ФормаДокумента = ПолучитьФорму("Документ.ТелефонныйЗвонок.ФормаОбъекта",,, Новый УникальныйИдентификатор);
//			ФормаДокумента.Объект.Дата = ДанныеЗвонка[Счетчик+3];
//			ФормаДокумента.Объект.АбонентКонтакт = ДанныеЗвонка[Счетчик+2];
//			ФормаДокумента.Объект.АбонентКакСвязаться = ДанныеЗвонка[Счетчик];
//			ФормаДокумента.Объект.Тема = "[Приём звонка]";
//			ФормаДокумента.Объект.Описание = "[Создано автоматически]";
//			ФормаДокумента.Объект.Входящий = Истина;
//			ФормаДокумента.РС_СозданАвтоматически = Истина;
//			ФормаДокумента.Открыть();
//			Счетчик = Счетчик + 4;
//		КонецЦикла;
//	КонецЕсли;
//КонецПроцедуры
////-- 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase