
&После("УстановкаПараметровСеанса")
Процедура РСК_УстановкаПараметровСеанса(ТребуемыеПараметры)
	//++ 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
	ПараметрыСеанса.РС_ДОМруИмяПользователя = ОпределитьПользователяДОМру(ПараметрыСеанса.ТекущийПользователь);
	//-- 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
КонецПроцедуры

//++ 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
Функция ОпределитьПользователяДОМру(Пользователь)
	
	ТокенАТС = Константы.РС_ТокенОблачнойАТС.Получить();
	Если НЕ ЗначениеЗаполнено(ТокенАТС) Тогда
		Возврат "@vpbx381206422.domru.biz";	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат "@vpbx381206422.domru.biz";	
	КонецЕсли;
	ВнутреннийНомер = УправлениеITОтделом8УФПовтИсп.ПолучитьЗначениеНастройки("РС_ВнутреннийНомер");
	Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
		Возврат "@vpbx381206422.domru.biz";
	КонецЕсли;
	//Обращение к серверу Дом.РУ для получения списка всех пользователей и их внутренних номеров
	Соединение = Новый HTTPСоединение("vpbx381206422.domru.biz",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос("/sys/crm_api.wcgp?cmd=accounts&token=" + Константы.РС_ТокенОблачнойАТС.Получить());
	Попытка
		Результат = Соединение.Получить(Запрос);
	Исключение
		Сообщить("Ошибка подключения к серверу ДОМ.ру для установления логина пользователя АТС");
		Возврат "@vpbx381206422.domru.biz";
	КонецПопытки;
	Если Не ЗначениеЗаполнено(Результат.ПолучитьТелоКакСтроку()) Тогда
		Возврат "@vpbx381206422.domru.biz";
	КонецЕсли;
	СтрокаJSON = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	ЧтениеJSON.Прочитать();
	ДОМруПользователь = "@vpbx381206422.domru.biz";
	//Перебор полученного списка и поиск пользователя, соответствующего внутреннему номеру, указанному в настройках пользователя
	Пока ЧтениеJSON.Прочитать() Цикл
		Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.КонецМассива Тогда
			Прервать;
		КонецЕсли;
		ЧтениеJSON.Прочитать();
		Номер = "";
		Ник = "";
		Пока Номер = "" ИЛИ Ник = "" Цикл
			Если ЧтениеJSON.ТекущееЗначение = "name" Тогда
				ЧтениеJSON.Прочитать();	
				Ник = ЧтениеJSON.ТекущееЗначение;
			ИначеЕсли ЧтениеJSON.ТекущееЗначение = "ext" Тогда
				ЧтениеJSON.Прочитать();	
				Номер = ЧтениеJSON.ТекущееЗначение;
			Иначе
				ЧтениеJSON.Прочитать();
			КонецЕсли;	
			ЧтениеJSON.Прочитать();
		КонецЦикла;
		
		Если Номер = ВнутреннийНомер Тогда
			ДОМруПользователь = Ник + ДОМруПользователь;
			Прервать;
		КонецЕсли;
		
		Пока ЧтениеJSON.ТипТекущегоЗначения <> ТипЗначенияJSON.КонецОбъекта Цикл
			ЧтениеJSON.Прочитать();
		КонецЦикла;
	КонецЦикла;
	Возврат ДОМруПользователь;
КонецФункции
//-- 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
