//++ Горохов И. 31.05.21 Задача №7054
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
		Объект.Клиент = Параметры.Клиент;
	ИначеЕсли Параметры.ПараметрыВыбора.Свойство("Клиент") тогда
		Объект.Клиент = Параметры.ПараметрыВыбора.Клиент;
		Объект.Родитель = Неопределено;
	КонецЕсли;	
	
	//Если Параметры.Свойство("Родитель") Тогда
	//	Объект.Родитель = Параметры.Родитель;
	//КонецЕсли;
	
	//Объект.РуководительПроекта 	= ПользователиКлиентСервер.ТекущийПользователь();
	//Объект.ДатаНачала 			= Дата("00010101");
	//Объект.ДатаНачалаПлан 		= Дата("00010101");
	//Объект.ДатаОкончания		= Дата("00010101");
	//Объект.ДатаОкончанияПлан 	= Дата("00010101");
	//Объект.Статус = Перечисления.СтатусыПроекта.ВРаботе;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задание.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Задание КАК Задание
		|ГДЕ
		|	Задание.Проект = &Проект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Задание.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Стр = ТабЗадачи.Добавить();
			Стр.Задача = ВыборкаДетальныеЗаписи.Ссылка;
			ТабИсполнители = ВыборкаДетальныеЗаписи.Ссылка.Исполнители;
			СтрИсполнитель = "";
			МассивДобавленных = Новый Массив;
			Для каждого Запись из ТабИсполнители цикл
				Если МассивДобавленных.Найти(Запись.Исполнитель) = Неопределено тогда
					МассивДобавленных.Добавить(Запись.Исполнитель);
				Иначе
					Продолжить;
				КонецЕсли;
				СтрИсполнитель = СтрИсполнитель + Строка(Запись.Исполнитель) +";";		
			КонецЦикла;
			Стр.Исполнитель = СтрИсполнитель;
		КонецЦикла;	
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() или НЕ ЗначениеЗаполнено(Объект.ТипПроекта) Тогда
		Объект.ТипПроекта = Перечисления.РСК_ТипыПроектов.Сопровождение;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РСК_Клиент1НачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТипСтр = "СправочникСсылка.Контрагенты";
    Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
    Значение = Объект.Клиент;
    Объект.Клиент = Элемент.ОграничениеТипа.ПривестиЗначение(Значение);
    Элемент.ВыбиратьТип = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура РСК_ПриОткрытииПосле(Отказ)
	//УстановитьТекущуюСтраницу();  // Макаров СА. убрал, что за бред открывать не главную страницу сразу.
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтраницу()
	Если НЕ Объект.Ссылка = Справочники.Проекты.ПустаяСсылка() тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.Задачи;	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура РСК_ТабЗадачиВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
 	ПоказатьЗначение(,ТабЗадачи[ЭтаФорма.Элементы.ТабЗадачи.ТекущаяСтрока].Задача);
КонецПроцедуры


&НаКлиенте 
Процедура УправлениеВидимостью()
	Элементы.ОтветственныйЗаОтчет1.Видимость= НЕ(Объект.ТипПроекта = ПредопределенноеЗначение("Перечисление.РСК_ТипыПроектов.Проект"));
	Элементы.РуководительПроекта1.Заголовок = ?(Объект.ТипПроекта = ПредопределенноеЗначение("Перечисление.РСК_ТипыПроектов.Проект"),"Руководитель проекта","Менеджер сопровождения");
КонецПроцедуры
&НаКлиенте
Процедура РСК_ТипПроектаПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	УправлениеВидимостью();
КонецПроцедуры
//-- Конец задачи №7054
