
Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.1.342");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "2303.30.0";
	ПараметрыРегистрации.Информация = "Картошка";
	ПараметрыРегистрации.Назначение.Добавить("Документ.Задание");
	ПараметрыРегистрации.ОпределитьНастройкиФормы = Истина;
	
	Назначения = Новый Массив;
	Назначения.Добавить(Документы.Задание);
	ПараметрыРегистрации.Назначение = Назначения;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("Показать отчёт");
	Команда.Идентификатор = ОбщегоНазначения.КонтрольнаяСуммаСтрокой("ПоказатьОтчёт");
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	Возврат ПараметрыРегистрации;
КонецФункции